<?php

namespace App\DataFixtures;

use App\Entity\Paragraph;
use App\Entity\Theme;
use Doctrine\Common\DataFixtures\DependentFixtureInterface;


class ParagraphFixtures extends BaseFixtures implements DependentFixtureInterface
{
    protected $paragraphs = [
        [
            'Формула Байеса позволяет найти вероятность каждой из гипотез о том, в результате какого из событий, образующих полную систему, наступило событие A (или как часто говорят, найти апостериорные вероятности).',
            'Широко известен частный случай теоремы Лапласа — разложение определителя по строке или столбцу.',
            'Функция называется возрастающей если большему значению аргумента соответствует большее значение функции, а меньшему соответствует меньше.',
            'Если отбросить некоторое число слагаемых ряда или добавить к ряду несколько слагаемых, то это не повлияет на сходимость (расходимость) ряда.',
            'Остаток ряда Лейбница имеет знак первого элемента, входящего в его сумму. Для доказательства двух следующих признаков нам понадобится следующее преобразование.',
            'Раздел математического анализа, в котором изучаются понятия интеграла, его свойства и методы вычислений.',
            'Риман формализовал понятие интеграла, разработанное Ньютоном и Лейбницем, как площади подграфика (фигуры, заключенной между графиком функции и осью абсцисс). Для этого он рассмотрел фигуры, состоящие из нескольких вертикальных прямоугольников и получающиеся при разбиении отрезка.'
        ],
        [
            'Специальная теория относительности применима для изучения движения тел с любыми скоростями (в том числе близкими или равными скорости света) при условии отсутствия очень сильных гравитационных полей.',
            'Общая теория относительности — теория гравитации, опубликованная Эйнштейном в 1915—1916 годах.',
            'Первый закон Ньютона постулирует существование инерциальных систем отсчёта.',
            'Во-первых, термин «тело» следует заменить термином «материальная точка», так как тело конечных размеров в отсутствие внешних сил может совершать и вращательное движение.',
            'Изотропность — одинаковость свойств пространства по всем направлениям, то есть поворот любой замкнутой физической системы как целого не изменяет её физические свойства.',
            'Математически выражается через векторную сумму всех моментов импульса относительно выбранной оси для замкнутой системы тел, которая остается постоянной, пока на систему не воздействуют моменты внешних сил.',
            'Во всех наблюдавшихся процессах лептонное число в замкнутой системе сохраняется, поэтому был сформулирован закон сохранения лептонного заряда, являющийся одним из экспериментальных оснований Стандартной Модели физики элементарных частиц.',
        ],
        [
            'Это объясняется, прежде всего, тем, что у комплексных анионов бора (а именно в таком виде он входит в большинство минералов) нет достаточно распространённых аналогов.',
            'Средний химический состав Земли в целом рассчитывался на основании данных о содержании элементов в метеоритах.',
            'Кадмий расположен в одной группе периодической системы с цинком и ртутью, занимая промежуточное место между ними, поэтому некоторые химические свойства этих элементов сходны.',
            'Атом другого химического элемента в чистой кристаллической решётке (например, атом фосфора, бора и т. д. в кристалле кремния) называется примесью.',
            'Во время разрыва связи между электроном и ядром появляется свободное место в электронной оболочке атома.',
            'Транзистор — полупроводниковое устройство, которое состоит из двух областей с полупроводниками p- или n-типа, между которыми находится область с полупроводником n- или p-типа. Таким образом, в транзисторе есть две области p-n перехода.',
            'Исследуя газы, нашёл в 1874 году общее уравнение состояния идеального газа, включающее, как частность, зависимость состояния газа от температуры, которую в 1834 году обнаружил физик Б. П. Э. Клапейрон.'
        ],
        [
            'Главной темой «Богатства» Смит во введении называет экономическое развитие — действующие в человеческом обществе силы и закономерности, благодаря которым растёт общий доход.',
            'В экономической теории протекционистская доктрина является противоположной доктрине свободной торговли — фритредерству.',
            'Целью эмбарго могут являться репрессалии в отношении другого государства, желание нанести ему материальный ущерб и принудить действовать по указаниям вводивших его.',
            'Бухгалтерский баланс имеет форму двусторонней таблицы. Каждая строка таблицы (балансовый счёт) представляет собой наименование объекта бухгалтерского учёта и его стоимость на момент составления баланса.',
            'Цель стандартов финансовой отчётности — сократить различия и выбор трактовки в предоставлении финансовой отчётности, улучшить качество и сопоставимость информации, унификация стандартов.',
            'Эмиссия компаниями ценных бумаг (акций и облигаций) является одним из средств привлечения долгосрочного (эмитированного) капитала.',
            'Говоря о собственных средствах, следует отметить, что в мировой практике и российском законодательстве понятия «собственные средства», «собственный капитал», «чистые активы» зачастую используются как аналогичные.'
        ],
        [
            'Безалаберному охотнику («Ермолай и мельничиха») барин разрешил жить где угодно при условии, что тот будет ежемесячно приносить ему на кухню две пары тетеревов и куропаток.',
            'В первой повести М. Е. Салтыкова, «Противоречия», которую он никогда впоследствии не перепечатывал, звучит, сдавленно и глухо, та самая тема, на которую были написаны ранние романы Ж. Санд: признание прав жизни и страсти.',
            'После отделения «Современной летописи» от журнала «Русский вестник» приобрёл репутацию относительно нейтрального и респектабельного издания и привлёк крупнейших русских писателей.',
            'Склонность Лескова к неожиданным развязкам (пуантам) ярко проявилась в святочных рассказах и новеллах-анекдотах.',
            'Один из наиболее политизированных романов Достоевского был написан им под впечатлением от ростков террористического и радикального движений в среде русских интеллигентов, разночинцев и прочих. ',
            'Африка ещё с детства привлекала Гумилёва, его вдохновляли подвиги русских офицеров-добровольцев в Абиссинии (позднее он даже повторит маршрут Александра Булатовича и частично маршруты Николая Леонтьева).',
            'Становление акмеизма тесно связано с деятельностью «Цеха поэтов», оппозиционной «Академии стиха», центральными фигурами которого являлись основатели акмеизма Николай Гумилёв, Анна Ахматова (была секретарём «Цеха») и Сергей Городецкий.'
        ]
    ];

    public function load($manager)
    {

        $this->manager = $manager;

        foreach ($this->paragraphs as $key=>$theme) {

            foreach ($theme as $text) {

                $this->makeOne(Paragraph::class, function (Paragraph $paragraph) use ($manager, $key, $text) {

                    /**
                     * @param Paragraph $paragraph
                     */

                    $paragraph->setText($text);

                    $paragraph->setTheme($this->getIndexReference(Theme::class, $key));

                    $manager->persist($paragraph);

                });
            }
        }

        $manager->flush();

    }

    public function getDependencies()
    {
        return [
            ThemeFixtures::class
        ];
    }
}
