<?php

namespace App\DataFixtures;

use App\Entity\Theme;
use App\Entity\Title;
use Doctrine\Common\DataFixtures\DependentFixtureInterface;


class TitleFixtures extends BaseFixtures implements DependentFixtureInterface
{
    protected $titles = [
        [
            'Коши - интеграл',
            'Интегральня теорема Лапласа',
            'Производня и окрестность точки числовой прямой',
            'Непрерывность функции',
            'Геометрия - наука о пространстве',
            'Гипотезы в теории вероятнстей',
            'Показательная функция'
        ],
        [
            'Классическая механика',
            'Специальная теория относительности',
            'Квантовая механика',
            'Методы теоретической физики в других науках',
            'Квантовая теория поля',
            'Единая теория слабого и электромагнитного взаимодействий',
            'Классическая электродинамика',
        ],
        [
            'Теория кристаллического поля',
            'Октаэдрические комплексы. Общие понятия',
            'Низкоспиновые и высокоспиновые комплексы',
            'Винилхлорид',
            'Методы для моделирования молекулярных структур',
            'Приближение Борна — Оппенгеймера',
            'Химическая кинетика'
        ],
        [
            'Адаптация персонала как основа формирования кадровой политики организации',
            'Методы экономической теории',
            'Функции экономической теории',
            'История экономических учений',
            'Предпосылки возникновения эконометрики',
            'Регрессионный анализ',
            'Новая институциональная экономика'
        ],
        [
            'Александр Пушкин',
            'История русской литературной критики',
            'Виссарион Григорьевич Белинский',
            'Романтизм - противопоставление реальности',
            'Поэзия и проза',
            'Гумилёв и Блок - сопреники и друзья',
            'Французский символизм'
        ]
    ];

    public function load($manager)
    {
        $this->manager = $manager;

        foreach ($this->titles as $key => $theme) {

            foreach ($theme as $text) {

                $this->makeOne(Title::class, function (Title $title) use ($manager, $key, $text) {

                    /**
                     * @param Title $title
                     */

                    $title->setText($text);

                    $title->setTheme($this->getIndexReference(Theme::class, $key));

                    $manager->persist($title);

                });
            }

        }

        $manager->flush();

    }

    public function getDependencies()
    {
        return [
            ThemeFixtures::class
        ];
    }
}
